"""
VAR 6
Поведінка ізольованої  популяції

Припустимо, що кількість алігаторів P(t) (t виражається в місяцях) в болоті задовольняє диференціальне рівняння
dP/dt = 0.0001 * P^2(t) - 0.01 * P(t)
Нехай спочатку в болоті нараховується 25 алігаторі.
Розв'яжіть це диференціальне рівняння та визначте, що станеться з популяцією в майбутньому.
Що станеться з популяцією алігаторів, якщо початкова чисельність тварин становитиме 150 особин?
Побудувати графіки чисельності популяцій для двох випадків.
"""

import matplotlib.pyplot as plt
from scipy.integrate import odeint
import numpy as np
import seaborn as sns
sns.set()


def dPdt(P, t):
    return 0.0001 * P**2 - 0.01 * P


t = np.linspace(0, 12, 10000)
P1, P2 = 25, 150

P1_sol = odeint(dPdt, P1, t)
P2_sol = odeint(dPdt, P2, t)


fig, [ax1, ax2, ax3] = plt.subplots(3, 1, figsize=(6, 8))
ax1.plot(t, P1_sol, label='$P(0) = 25$')
ax1.plot(t, P2_sol, 'r', label='$P(0) = 150$')
ax1.legend()

ax2.plot(t, P1_sol, label='$P(0) = 25$')
ax2.set_ylabel('особин алігаторів')
ax2.legend()

ax3.plot(t, P2_sol, 'r', label='$P(0) = 150$')
ax3.set_xlabel('час')
ax3.legend()

ax1.legend()

fig.tight_layout()
plt.show()


'''
Модель що розглядається в задачі --- модель Верхюльста, канонічним записом якої є 
dN/dt = r * N *( 1 - N/q), N(0) = N_0,

де r --- коефіцієнт росту. Іншою назвою є `рівняння логістичного росту'. 
У нашій задачі коефіцієнт росту ---  -0.01
Модель враховує внутрішньовидову конкуренцію 
(містить член -c * N^2), тому популяції не зростають необмежено а прямують до ємності середовища, 
у нашому випадку --- 100 особин алігатоів

Отримані аналітичні та чисельні розв'язки повністю підтверджують теоретичні результати.

'''