"""
VAR 11
Вихiдна популяцiя складається з трьох вiкових груп

Матриця Леслi має вигляд
(0   9  15)
(1/3 0   0)
(0  1/2  0)
У початковий момент часу (t = 0) популяцiя складається з двох самок
молодшого та трьох самок середнього вiку та однієї свмки старшого виду
Знайти:
1. склад x(t) у момент часу t = 18;
2. стiйку вiкову структуру популяцiї;
3. момент часу, коли загальна кiлькiсть популяцiї перевищить 110 особин
"""


import numpy as np

# матриця Леслі
L = np.array([
    [  0,   9, 15],
    [1/3,   0,  0],
    [  0, 1/2,  0]
])

# початковий розподіл популяції
x0 = np.array([2, 3, 1])

# розподіл через t кроків обчислюємо як L^t * x0
t = 18
xt = np.dot(np.linalg.matrix_power(L, t), x0)
print(f'x({t}) = {xt}')

# Для визначення стiйкої структури популяцiї (темп росту) знайдемо власнi числа матрицi Леслi:
l, v = np.linalg.eig(L)
# знаходимо найбільше додатне власне значення та відповідний вектор
arg = np.argmax(l)
l_max = l[arg]
v_max = v[:, arg]

print(f'lambda_L = {l_max}')

# нормуємо власний вектор в ||x(t)||_1 нормі щоб дiзнатися вiдсоткове спiввiдношення чисельностей вiкових груп
v_normed = v_max / np.linalg.norm(v_max, 1)

print(f'x_L = {np.abs(v_normed)}%')

# знаходимо min t: ||x(t)||_1 > 110
t = 0
while np.sum(x0) <= 110:
    x0 = np.dot(L, x0)
    t += 1

print(f't = {t}, X({t}) = {np.sum(x0)}')

